---
kind: property
id: P:Autodesk.Revit.DB.PrintManager.PaperSources
source: html/c22a7905-70b3-f31f-c832-531e6828b1fb.htm
---
# Autodesk.Revit.DB.PrintManager.PaperSources Property

Get all print sources of current printer.

## Syntax (C#)
```csharp
public PaperSourceSet PaperSources { get; }
```

## Remarks
These are the valid paper source for the current printer.